# coding: utf-8

"""
计算上证50、沪深300、中证500和上证指数相关系数, 并比较用谁的相关系数更高
"""

from common.Functions import *
import datetime

bench = "sh000001"

index_code_list = ['sh000016', 'sh000300', 'sh000905']

name_map = {
    'sh000001': "上证指数",
    'sh000016': "上证50",
    'sh000300': "沪深300",
    'sh000905': "中证500",
}

bench_df = import_index_data(index_code=bench)
bench_df.set_index("交易日期", inplace=True)
index_df_map = {

}

for code in index_code_list:
    index_df = import_index_data(index_code=code)
    index_df.set_index("交易日期", inplace=True)
    index_df_map[code] = index_df

for year in range(2006, 2020):
    start_date = datetime.datetime(year=year, month=1, day=1)
    end_date = datetime.datetime(year=year + 1, month=1, day=1)

    cur_year_bench = bench_df[(bench_df.index >= start_date) & (bench_df.index < end_date)]["收盘价"]
    # print(cur_year_bench)

    for code in index_code_list:
        index_df = index_df_map[code]
        cur_year_index = index_df[(index_df.index >= start_date) & (index_df.index < end_date)]["收盘价"]
        # print(cur_year_index)
        corr = cur_year_bench.corr(cur_year_index)

        print("{}上证指数与{}相关系数: {}".format(year, name_map[code], corr))

for code in index_code_list:
    index_df = index_df_map[code]
    index_close = index_df[(index_df.index >= "2006-01-01") & (index_df.index < "2020-01-01")]["收盘价"]
    bench_close = bench_df[(bench_df.index >= "2006-01-01") & (bench_df.index < "2020-01-01")]["收盘价"]
    # print(cur_year_index)
    corr = bench_close.corr(index_close)

    print("上证指数与{}全部数据相关系数: {}".format(name_map[code], corr))

"""
结论: 与上证指数相关系数大小关系: 沪深300 > 上证50 > 中证500
2006上证指数与上证50相关系数: 0.9857239877231941
2006上证指数与沪深300相关系数: 0.9951474484536214
2006上证指数与中证500相关系数: 0.9038335440081284
2007上证指数与上证50相关系数: 0.9948718891240972
2007上证指数与沪深300相关系数: 0.9935717444178106
2007上证指数与中证500相关系数: 0.9123508828108785
2008上证指数与上证50相关系数: 0.9982034038266915
2008上证指数与沪深300相关系数: 0.9979581607192529
2008上证指数与中证500相关系数: 0.9826414273723928
2009上证指数与上证50相关系数: 0.9939789050644082
2009上证指数与沪深300相关系数: 0.9990966572392797
2009上证指数与中证500相关系数: 0.9585949376424167
2010上证指数与上证50相关系数: 0.95911298269618
2010上证指数与沪深300相关系数: 0.9755979617290128
2010上证指数与中证500相关系数: 0.6688855199346119
2011上证指数与上证50相关系数: 0.9901460511783643
2011上证指数与沪深300相关系数: 0.9969728954197262
2011上证指数与中证500相关系数: 0.9776584176999477
2012上证指数与上证50相关系数: 0.9499508485784933
2012上证指数与沪深300相关系数: 0.9831861851492746
2012上证指数与中证500相关系数: 0.9167211832230909
2013上证指数与上证50相关系数: 0.9417375869443211
2013上证指数与沪深300相关系数: 0.9877834360051498
2013上证指数与中证500相关系数: 0.13183197899751847
2014上证指数与上证50相关系数: 0.9709855692589435
2014上证指数与沪深300相关系数: 0.9918587099342108
2014上证指数与中证500相关系数: 0.9185135154881201
2015上证指数与上证50相关系数: 0.9288676237640799
2015上证指数与沪深300相关系数: 0.9935417279481658
2015上证指数与中证500相关系数: 0.935680383151631
2016上证指数与上证50相关系数: 0.9490245321902526
2016上证指数与沪深300相关系数: 0.988604519153643
2016上证指数与中证500相关系数: 0.944569720320459
2017上证指数与上证50相关系数: 0.76369916033641
2017上证指数与沪深300相关系数: 0.8319315765897822
2017上证指数与中证500相关系数: 0.7909177834936235
2018上证指数与上证50相关系数: 0.9604891413673109
2018上证指数与沪深300相关系数: 0.9981153715257476
2018上证指数与中证500相关系数: 0.9693563758092181
2019上证指数与上证50相关系数: 0.8075122061755124
2019上证指数与沪深300相关系数: 0.8989516233722868
2019上证指数与中证500相关系数: 0.9637529542595573
上证指数与上证50全部数据相关系数: 0.939090677157433
上证指数与沪深300全部数据相关系数: 0.9453075858095015
上证指数与中证500全部数据相关系数: 0.6463205042078325
"""
